Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: VIM USER MANUAL - by Bram Moolenaar
es_es: MANUAL DE USUARIO DE VIM - por Bram Moolenaar

source: *usr_10.txt* For Vim version 7.3. Last change: 2006 Nov 05
es_es: *usr_10.esx* Para Vim versión 7.3. Último cambio: 5/11/2006

source: Making big changes
es_es: Realizar grandes cambios

source: In chapter 4 several ways to make small changes were explained. This chapter goes into making changes that are repeated or can affect a large amount of text. The Visual mode allows doing various things with blocks of text. Use an external program to do really complicated things.
es_es: En el capítulo 4 se explicaron algunas formas de hacer cambios pequeños. Este capítulo tratará de cambios que se repiten o que afectan a grandes porciones del texto. El modo Visual permite hacer varias cosas con bloques de texto. Use un programa externo para hacer las cosas más complicadas.

source: |10.1| Record and playback commands |10.2| Substitution |10.3| Command ranges |10.4| The global command |10.5| Visual block mode |10.6| Reading and writing part of a file |10.7| Formatting text |10.8| Changing case |10.9| Using an external program
es_es: |10.1| Órdenes de grabación y reproducción |10.2| Sustitución |10.3| Rangos de aplicación |10.4| Las órdenes globales |10.5| El modo de bloque Visual |10.6| Leer y escribir parte de un archivo |10.7| Formatear texto |10.8| Cambiar mayúsculas y minúsculas |10.9| Uso de un programa externo

source: Next chapter: |usr_11.txt| Recovering from a crash Previous chapter: |usr_09.txt| Using the GUI Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_11.esx| Recuperarse de un fallo Capítulo anterior: |usr_09.esx| Uso de la interfaz gráfica Tabla de contenidos: |usr_toc.esx|

source: *10.1* Record and playback commands
es_es: *10.1* Órdenes de grabación y reproducción

source: The "." command repeats the preceding change. But what if you want to do something more complex than a single change? That's where command recording comes in. There are three steps:
es_es: La orden «.» repite el cambio precedente. ¿Pero qué ocurre si quiere hacer algo más complicado que un simple cambio? Para eso tenemos la orden de grabación («:recording»). Hay que seguir tres pasos:

source: 1. The "q{register}" command starts recording keystrokes into the register named {register}. The register name must be between a and z. 2. Type your commands. 3. To finish recording, press q (without any extra character).
es_es: 1. La orden «q{registro}» inicia la grabación de teclas pulsadas en un registro llamado{registro}. El nombre del registro debe estar en el rango (a-z). 2. Introduzca sus órdenes. 3. Pulse q para detener la grabación (sin ningún carácter adicional).

source: Take a look at how to use these commands in practice. You have a list of filenames that look like this:
es_es: Vamos a echarle un vistazo a cómo se usan las órdenes en la práctica. Tiene una lista de nombres de archivo como esta:

source: You start by moving to the first character of the first line. Next you execute the following commands:
es_es: Comienza desplazándose al primer carácter de la primera línea. A continuación ejecute la siguiente orden:

source: qa Start recording a macro in register a. ^ Move to the beginning of the line. i#include "<Esc> Insert the string #include " at the beginning of the line. $ Move to the end of the line. a"<Esc> Append the character double quotation mark (") to the end of the line. j Go to the next line. q Stop recording the macro.
es_es: qa Comenzar a grabar la macro en el registro «a». ^ Ir al comienzo de la línea. i#include "<Esc> Insertar el #include " al comienzo de cada línea. $ Ir al final de la línea. a"<Esc> Añadir el carácter de comillas dobles (") al final de la línea. j Ir a la próxima línea. q Detener la grabación de la macro.

source: Now that you have done the work once, you can repeat the change by typing the command "@a" three times. The "@a" command can be preceded by a count, which will cause the macro to be executed that number of times. In this case you would type: >
es_es: Ahora que ha realizado el trabajo una vez, puede repetir el cambio tecleando la orden «@a» tres veces. La orden «@a» puede venir precedido de un multiplicador, el cuál causará que la macro se ejecute ese número determinado de veces. En este caso: >

source: You might have the lines you want to change in various places. Just move the cursor to each location and use the "@a" command. If you have done that once, you can do it again with "@@". That's a bit easier to type. If you now execute register b with "@b", the next "@@" will use register b. If you compare the playback method with using ".", there are several differences. First of all, "." can only repeat one change. As seen in the example above, "@a" can do several changes, and move around as well. Secondly, "." can only remember the last change. Executing a register allows you to make any changes and then still use "@a" to replay the recorded commands. Finally, you can use 26 different registers. Thus you can remember 26 different command sequences to execute.
es_es: Tal vez tenga las líneas que quiere cambiar en varios lugares. Simplemente mueva el cursor a cada ubicación y use la orden «@a». Si ha hecho eso una vez, puede repetirlo con «@@». Es un poco más sencillo de teclear. Si ejecuta el registro b con «@b», el próximo «@@» usará el registro b. Si compara esto con el método «.», hay varias diferencias. Lo primero, «.x sólo puede repetir un cambio. Como ha podido ver en el ejemplo de arriba, «@a» puede llevar a cabo varios cambios, incluyendo movimientos. Por otro lado, «.» sólo puede recordar el último cambio. Ejecutar un registro le permite hacer algunos cambios en el texto y poder usar todavía las órdenes grabadas. Por último, puede usar 26 registros distintos. De este modo puede reusar 26 secuencias diferentes.

source: The registers used for recording are the same ones you used for yank and delete commands. This allows you to mix recording with other commands to manipulate the registers. Suppose you have recorded a few commands in register n. When you execute this with "@n" you notice you did something wrong. You could try recording again, but perhaps you will make another mistake. Instead, use this trick:
es_es: Los registros que se usan para grabar son los mismos que se usan para las órdenes de copiar y eliminar. Esto le permite mezclar la grabación con otras órdenes para manipular los registros. Suponga que ha grabado algunas órdenes en el registro n. Cuando lo ejecuta con «@n», se da cuenta de que algo no va bien. Podría intentar grabarlo de nuevo, pero quizá cometa otro error. Mejor usar este truco:

source: Now you can execute the corrected commands with "@n". (If your recorded commands include line breaks, adjust the last two items in the example to include all the lines.)
es_es: Ahora puede ejecutar las órdenes corregidas con «@n». (Si las órdenes grabadas incluyen saltos de línea, ajuste los dos últimos puntos explicados anteriormente para incluir todas las líneas.)

source: So far we have used a lowercase letter for the register name. To append to a register, use an uppercase letter. Suppose you have recorded a command to change a word to register c. It works properly, but you would like to add a search for the next word to change. This can be done with: >
es_es: Hasta el momento hemos usado letras en minúscula para el nombre del registro. Para añadir a un registro, use una letra en mayúscula. Suponga por un momento que ha grabado una orden para cambiar una palabra en el registro c. Funciona correctamente, pero quisiera añadir una búsqueda para la siguiente palabra a cambiar. Esto se puede hacer así: >

source: qC/word<Enter>q
es_es: qC/palabra<Entrar>q

source: You start with "qC", which records to the c register and appends. Thus writing to an uppercase register name means to append to the register with the same letter, but lowercase.
es_es: Comience con «qC», que añadirá al registro c. De este modo siempre podrá escribir el registro al que quieras añadir nuevos pasos mediante la misma de letra de identificación, pero en mayúscula.

source: This works both with recording and with yank and delete commands. For example, you want to collect a sequence of lines into the a register. Yank the first line with: >
es_es: Esto funciona tanto grabando como y con las órdenes de copiar y eliminar. Por ejemplo, quieres reunir una secuencia de líneas en un registro. Copie la primera línea con: >

source: Repeat this command for all lines. The a register now contains all those lines, in the order you yanked them.
es_es: Repita la orden para todas las líneas. El registro «a» contiene ahora todas estas líneas, en el orden en el que las ha copiado.

source: *10.2* Substitution *find-replace*
es_es: *10.2* Sustitución

source: The ":substitute" command enables you to perform string replacements on a whole range of lines. The general form of this command is as follows: >
es_es: La orden «:substitute» le permite ejecutar sustituciones de cadenas de caracteres en un rango de líneas. La forma general es la siguiente: >

source: :[range]substitute/from/to/[flags]
es_es: :[rango]substitute/de/a/[opciones]

source: This command changes the "from" string to the "to" string in the lines specified with [range]. For example, you can change "Professor" to "Teacher" in all lines with the following command: >
es_es: Esta orden cambia la cadena «de» por la cadena «a» en las líneas especificadas con [rango]. Por ejemplo, puede cambiar «profesor» por «maestro» en todas las líneas con la siguiente orden: >

source: :%substitute/Professor/Teacher/ < Note: The ":substitute" command is almost never spelled out completely. Most of the time, people use the abbreviated version ":s". From here on the abbreviation will be used.
es_es: :%substitute/profesor/maestro/ < Nota: La orden «:substitute» casi nunca se escribe completamente. La mayoría de las veces la gente escribe la versión abreviada ":s". A partir de ahora, se empleará la abreviatura.

source: The "%" before the command specifies the command works on all lines. Without a range, ":s" only works on the current line. More about ranges in the next section |10.3|.
es_es: El «%» antes de la orden especifica que se ejecuta en todas las líneas. Sin rango, «:s» sólo funciona en la línea actual. Más sobre los rangos en la próxima sección |10.3|.

source: By default, the ":substitute" command changes only the first occurrence on each line. For example, the preceding command changes the line:
es_es: Por omisión, la orden «:substitute» cambia sólo la primera palabra encontrada en cada línea. Por ejemplo, la orden anterior cambia esta línea:

source: Professor Smith criticized Professor Johnson today. ~
es_es: El profesor Pinilla ha criticado hoy al profesor Burgos. ~

source: Teacher Smith criticized Professor Johnson today. ~
es_es: El maestro Pinilla ha criticado hoy al profesor Burgos. ~

source: To change every occurrence on the line, you need to add the g (global) flag. The command: >
es_es: Para cambiar todas palabras que aparezcan en la línea deberá usar la opción g (global). La orden: >

source: :%s/Professor/Teacher/g
es_es: :%s/profesor/maestro/g

source: Teacher Smith criticized Teacher Johnson today. ~
es_es: El maestro Pinilla ha criticado hoy al maestro Burgos. ~

source: Other flags include p (print), which causes the ":substitute" command to print out the last line it changes. The c (confirm) flag tells ":substitute" to ask you for confirmation before it performs each substitution. Enter the following: >
es_es: Otras opciones incluyen p (print = imprimir), que hace la orden «:s» muestre en pantalla la última línea que cambió. La «c» (confirm = confirmar) le dice a «:s» que pida confirmación antes que se ejecute cada sustitución. Introduzca lo siguiente: >

source: :%s/Professor/Teacher/c
es_es: :%s/profesor/maestro/c

source: Vim finds the first occurrence of "Professor" and displays the text it is about to change. You get the following prompt: >
es_es: Vim encuentra la primera aparición de «profesor» y muestra el texto que está a punto de cambiar. Le aparecerá la siguiente pregunta: >

source: replace with Teacher (y/n/a/q/l/^E/^Y)?
es_es: replace with maestro (y/n/a/q/l/^E/^Y)?

source: y Yes; make this change. n No; skip this match. a All; make this change and all remaining ones without further confirmation. q Quit; don't make any more changes. l Last; make this change and then quit. CTRL-E Scroll the text one line up. CTRL-Y Scroll the text one line down.
es_es: y Si; hacer el cambio. n No; omitir esta coincidenci. a Todo; hacer este cambio y todos los restantes sin pedir más confirmación. q Quit; no hacer más cambios. l Último; hacer este cambio y salir. CTRL-E Desplazar el texto hacia arriba. CTRL-Y Desplazar el texto hacia abajo.

source: :s/^the/these/
es_es: :s/^Eso/Aquello/

source: If you are substituting with a "from" or "to" part that includes a slash, you need to put a backslash before it. A simpler way is to use another character instead of the slash. A plus, for example: >
es_es: Si sustituye con una parte «de» o «a» que incluyan una barra inclinada, tendrá que poner una barra inversa antes de él. Una forma más sencilla es usar otro carácter como separador en lugar de la barra. Un «+», por ejemplo: >

source: :s+one/two+one or two+
es_es: :s+uno/dos+uno o dos+

source: *10.3* Command ranges
es_es: *10.3* Rangos de aplicación

source: The ":substitute" command, and many other : commands, can be applied to a selection of lines. This is called a range. The simple form of a range is {number},{number}. For example: >
es_es: La orden «:substitute» y muchas otras órdenes «:» se pueden aplicar a una selección de líneas. A esto se le llama rango. La forma más simple de un rango es {n},{n} (n es un número entero). Por ej: >

source: :1,5s/this/that/g
es_es: :1,5s/esto/aquello/g

source: Executes the substitute command on the lines 1 to 5. Line 5 is included. The range is always placed before the command.
es_es: Ejecuta la orden sustituir desde la línea 1 a la 5. La línea 5 queda incluida. El rango se sitúa justo antes de la orden.

source: :54s/President/Fool/
es_es: :54s/Político/Demagogo/

source: Some commands work on the whole file when you do not specify a range. To make them work on the current line the "." address is used. The ":write" command works like that. Without a range, it writes the whole file. To make it write only the current line into a file: >
es_es: Algunas órdenes funcionan sobre un archivo completo cuando no le especifica un rango. Para hacerlos funcionar en la línea actual, use «.». La orden «:write» funciona de ese modo. Sin un rango, escribe el archivo completo. Para hacer que sólo escriba una línea a un archivo: >

source: :.write otherfile
es_es: :.write otroarchivo

source: The first line always has number one. How about the last line? The "$" character is used for this. For example, to substitute in the lines from the cursor to the end: >
es_es: La primera línea siempre tiene como numeración el 1. ¿Pero qué ocurre con la última línea? Puede usar el carácter «$» ppara esto. Por ejemplo, para sustituir en las líneas desde la del cursor hasta el final: >

source: :.,$s/yes/no/
es_es: :.,$s/si/no/

source: Suppose you are editing a chapter in a book, and want to replace all occurrences of "grey" with "gray". But only in this chapter, not in the next one. You know that only chapter boundaries have the word "Chapter" in the first column. This command will work then: >
es_es: Suponga que está editado un capítulo de un libro y que desea reemplazar todas las palabras «grisx con «blanco». Pero sólo en ese capítulo, no en el siguiente. Sabe que los límites entre capítulos tienen la palabra «Capítulo» en la primera columna. Esta orden funcionaría aquí: >

source: :?^Chapter?,/^Chapter/s=grey=gray=g
es_es: :?^Capítulo?,/^Capítulo/s=gris=azul=g

source: You can see a search pattern is used twice. The first "?^Chapter?" finds the line above the current position that matches this pattern. Thus the ?pattern? range is used to search backwards. Similarly, "/^Chapter/" is used to search forward for the start of the next chapter. To avoid confusion with the slashes, the "=" character was used in the substitute command here. A slash or another character would have worked as well.
es_es: Puede observar que un patrón se ha usado en dos ocasiones. La primera «?^Chapter?» busca el patrón en sentido inverso. Por lo tanto «?patrón?» buscará encima de la línea actual. De forma similar, «/^Capítulo/» se usa para buscar hacia delante el comienzo del nuevo capítulo. Para evitar confusión con las barras, el carácter «=» se ha empleado en la orden sustituir. Una barra o cualquier otro carácter habría funcionado igual de bien.

source: There is a slight error in the above command: If the title of the next chapter had included "grey" it would be replaced as well. Maybe that's what you wanted, but what if you didn't? Then you can specify an offset. To search for a pattern and then use the line above it: >
es_es: Hay un pequeño error en la orden de arriba: Si el título del siguiente capítulo hubiese incluido «grisx habría sido reemplazado igualmente. Quizá quería eso, ¿pero qué ocurre si no? Puede especificar un «offset». Para buscar un patrón e indicar la línea anterior: >

source: /Chapter/-1
es_es: /Capítulo/-1

source: You can use any number instead of the 1. To address the second line below the match: >
es_es: Puede usar cualquier número en lugar de 1. Para indicar la segunda línea por debajo de la cadena encontrada: >

source: /Chapter/+2
es_es: /Capítulo/+2

source: The offsets can also be used with the other items in a range. Look at this one: >
es_es: El desplazamiento se puede emplear también con otros elementos en un rango. Observe esto: >

source: Instead of figuring out the line numbers of certain positions, remembering them and typing them in a range, you can use marks. Place the marks as mentioned in chapter 3. For example, use "mt" to mark the top of an area and "mb" to mark the bottom. Then you can use this range to specify the lines between the marks (including the lines with the marks): >
es_es: En lugar de adivinar el número de algunas líneas en determinadas posiciones, e introducirlas en un rango, puede usar marcadores. Ponga marcas como se explica en el capítulo 3. Por ejemplo, usa «ms» para marcar la parte superior de un área y «mi» para marcar la parte inferior". Puede usar el rango para especificar las líneas entre las marcas (inclusive): >

source: You can select text with Visual mode. If you then press ":" to start a colon command, you will see this: >
es_es: Puede seleccionar texto con el modo Visual. Si pulsa «:» para iniciar una orden, verá lo siguiente: >

source: Note: When using Visual mode to select part of a line, or using CTRL-V to select a block of text, the colon commands will still apply to whole lines. This might change in a future version of Vim.
es_es: Nota: Cuando use el modo Visual para seleccionar parte de una línea, o use CTRL-V para seleccionar un bloque de texto, las órdenes se aplicarán a líneas completas. Puede que esto cambie en una futura versión.

source: The '< and '> are actually marks, placed at the start and end of the Visual selection. The marks remain at their position until another Visual selection is made. Thus you can use the "'<" command to jump to position where the Visual area started. And you can mix the marks with other items: >
es_es: Los «'<» y «'>» son marcadores que se sitúan al principio y al final de la selección. Estos marcadores mantienen estas posiciones hasta que aparece una nueva selección Visual. Por lo tanto, puede usar la orden «"'<"» para saltar al lugar donde el área Visual comenzaba. También puede mezclarlas: >

source: When you know how many lines you want to change, you can type the number and then ":". For example, when you type "5:", you will get: >
es_es: Cuando sepa cuántas líneas quieres cambiar, puede teclear el número y luego «:». Si, por ejemplo, escribe «5:» obtendrá: >

source: Now you can type the command you want to use. It will use the range "." (current line) until ".+4" (four lines down). Thus it spans five lines.
es_es: Ahora puedes ejecutar la orden que quiera usar. Usará el rango «.» (línea actual) hasta «.+4» (cuatro líneas más). Esto hará un total de cinco líneas.

source: *10.4* The global command
es_es: *10.4* Las órdenes globales

source: The ":global" command is one of the more powerful features of Vim. It allows you to find a match for a pattern and execute a command there. The general form is: >
es_es: La orden «:global» es una de las características más potentes de Vim. Permite que encuentre una cadena con un patrón y ejecute una orden en esa ubicación. El formato habitual es: >

source: :[range]global/{pattern}/{command}
es_es: :[rango]global/{patrón}/{orden}

source: This is similar to the ":substitute" command. But, instead of replacing the matched text with other text, the command {command} is executed.
es_es: Esto es similar a la orden «:substitute». Pero en lugar de reemplazar el texto concordado con otro texto, la orden {orden} se ejecutará.

source: Note: The command executed for ":global" must be one that starts with a colon. Normal mode commands can not be used directly. The |:normal| command can do this for you.
es_es: Nota: La orden ejecutada con «:global» debe ser uno que comience con un punto y coma. Las órdenes para el modo Normal no se pueden emplear de forma directa. De esto se encargará |:normal|.

source: Suppose you want to change "foobar" to "barfoo", but only in C++ style comments. These comments start with "//". Use this command: >
es_es: Suponga que quiere cambiar «foobar» por «barfoo», pero solamente en los comentarios de C++. Estos comentarios empiezan por «//». Use lo siguiente: >

source: Just like with ":substitute", any pattern can be used. When you learn more complicated patterns later, you can use them here.
es_es: Tal y como ocurre con «:substitute», puede emplear cualquier patrón. Cuando aprenda patrones más complicados, podrá usarlos aquí.

source: *10.5* Visual block mode
es_es: *10.5* El modo de bloque Visual

source: With CTRL-V you can start selection of a rectangular area of text. There are a few commands that do something special with the text block.
es_es: Con CTRL-V puede seleccionar un área rectangular de texto. Hay algunas órdenes que hacen algo especial con los bloques de texto.

source: include one ~ include two ~ include three ~ include four ~
es_es: include uno ~ include dos ~ include tres ~ include cuatro ~

source: Move the cursor to the "o" of "one" and press CTRL-V. Move it down with "3j" to "four". You now have a block selection that spans four lines. Now type: >
es_es: Mueva el cursor a la «u» de «uno» y presione CTRL-V. Desplácese hacia abajo con «3j» hasta«"cuatro». Tiene una selección que abarca cuatro líneas. Teclee: >

source: The result:
es_es: El resultado:

source: include main.one ~ include main.two ~ include main.three ~ include main.four ~
es_es: include main.uno ~ include main.dos ~ include main.tres ~ include main.cuatro ~

source: If the block spans short lines that do not extend into the block, the text is not inserted in that line. For example, make a Visual block selection that includes the word "long" in the first and last line of this text, and thus has no text selected in the second line:
es_es: Si el bloque abarca líneas que no caben dentro del área del bloque, el texto no se insertará en esa línea. Por ejemplo, haga un bloque Visual que no incluya la palabra «larga» en la primera y última línea de este texto, de manera que no se seleccione texto en la segunda línea:
